import React from 'react'
import Header from '../components/Header'
import Footer from '../components/Footer'
import { useNavigate } from 'react-router-dom';

const AboutUs = () => {
  const navigate = useNavigate();
  return (
    <>
      <Header />
      <main>
        <div className="mycontainer">
          <p className='aboutInfo'>
            ברוכים הבאים לחנות הרנדומלית, המקום שבו אין חוקים, אין היגיון, ואין לנו מושג מה בדיוק אנחנו מוכרים! אתם שואלים, "מה יש בחנות רנדומלית?" ואנחנו עונים: לא יודעים! מברשת שיניים ליד כלי גינון, ספרי פילוסופיה ליד מדבקות של דינוזאורים, ואולי, אם יתמזל מזלכם, סנדוויץ' עם חומוס! למה להתבלבל מחנויות רגילות עם מחלקות מסודרות ומוצרים ברורים? בואו אלינו – המקום שבו הכל זורם.
            <br />
            <br />
            אז למה להיות חנות רנדומלית זה כל כך מדהים? קודם כל, אין אצלנו משעמם. כל ביקור הוא הרפתקה! לא תמצאו פה רשימות קניות, אלא יותר רוחות חופשיות שמחפשות הפתעות. התחלנו למכור נעליים? אולי, אולי זה רק נראה כמו נעל. קניתם צעצוע? יופי! רגע, האם זו בעצם מנורה? תמצאו תשובות לשאלות שבחיים לא שאלתם.
            <br />
            <br />
            היתרון המרכזי הוא האקשן: אתם אף פעם לא יודעים מה הולך לקרות. מי לא אוהב תחושת תעלומה באוויר? זה כמו גן שעשועים של מבוגרים! אנשים רגילים קונים מדפים באיקאה – אבל בחנות הרנדומלית, המדפים שלנו עשויים מנייר טואלט, ואתם יכולים אפילו לשלם עם גולות (תלוי ביום)!
            <br />
            <br />
            ועכשיו השאלה החשובה: למה לקנות דווקא אצלנו? התשובה פשוטה: אתם חייבים להרגיע את יצר הסקרנות שלכם! איפה עוד תוכלו לקנות חולצה ותה בשקית באותו מקום? תחשבו על זה: אצלנו אפשר לצאת מהחנות עם מוצרים שלעולם לא ידעתם שאתם צריכים, אבל עכשיו אתם לא יכולים לחיות בלעדיהם. חוץ מזה, מי צריך לדעת מה הוא קונה מראש? זה הרי הכי בנאלי!
            <br />
            <br />
            אז בפעם הבאה שאתם עוברים באזור ורוצים לחיות על הקצה, קפצו לחנות הרנדומלית – המקום שבו אתם אף פעם לא יודעים מה יקרה, ואנחנו אף פעם לא בטוחים למה.
          </p>
          <a className='conUs' onClick={()=>navigate("/contactUs")}>צור קשר</a>
        </div>
      </main>
      <Footer />
    </>
  )
}

export default AboutUs